Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/documenting.tmx
Source language: en
Languages: pl

source: This is just an overview of Sphinx' extended markup capabilities; full coverage can be found in `its own documentation <http://sphinx.pocoo.org/contents.html>`_.
pl: To jest po prostu ogląd rozszerzonych zdolności adnotacji Sphinx'a; pełne pokrycie może być dostępne w jego własnej dokumentacji <http://sphinx.pocoo.org/contents.html>`_.

source: Meta-information markup
pl: Adnotacje informacji pośrednich (-z ang. - meta-)

source: Identifies the author of the current section. The argument should include the author's name such that it can be used for presentation (though it isn't) and email address. The domain name portion of the address should be lower case. Example::
pl: Identyfikuje autora obecnej sekcji. Ten parametr powinien zawierać imię autora takie żeby mogło być używane dla prezentacji (chociaż nie jest) i adres email. Porcja adresu nazwy domeny powinna być pisana małymi literami. Na przykład::

source: .. sectionauthor:: Guido van Rossum <guido@python.org>
pl: .. autor sekcji:: Guido van Rossum <guido@python.org>

source: Currently, this markup isn't reflected in the output in any way, but it helps keep track of contributions.
pl: Obecnie, te adnotacje nie są odzwierciedlone w wyjściu w żaden sposób, ale to pomaga utrzymać na widoku wkład pracy.

source: Module-specific markup
pl: Adnotacje szczególne dla modułu

source: The markup described in this section is used to provide information about a module being documented. Each module should be documented in its own file. Normally this markup appears after the title heading of that file; a typical file might start like this::
pl: Adnotacje opisane w tym rozdziale są używane aby dostarczyć informacje o tym który moduł jest dokumentowany. Każdy moduł powinien być dokumentowany w swoim własnym pliku. Zwykle te adnotacje pojawiają się po tytule nagłówka tego pliku; typowy plik może zaczynać się następująco::

source: :mod:`parrot` -- Dead parrot access =================================== .. module:: parrot :platform: Unix, Windows :synopsis: Analyze and reanimate dead parrots. .. moduleauthor:: Eric Cleese <eric@python.invalid> .. moduleauthor:: John Idle <john@python.invalid>
pl: :mod:`papuga` -- dostęp zdechłej papugi =================================== .. module:: papuga :platform: Unix, Windows :synopsis: Analizuje i reanimuje zdechłe papugi. .. moduleauthor:: Eric Cleese <eric@python.invalid> .. moduleauthor:: John Idle <john@python.invalid>

source: As you can see, the module-specific markup consists of two directives, the ``module`` directive and the ``moduleauthor`` directive.
pl: Jak można zauważyć, szczególne dla modułu adnotacje składają się z dwóch dyrektyw: ``module`` i ``moduleauthor``

source: This directive marks the beginning of the description of a module, package, or submodule. The name should be fully qualified (i.e. including the package name for submodules).
pl: Ta dyrektywa zaznacza początek opisu modułu, pakietu lub podmodułu. Nazwa powinna być w pełni kwalifikowana (zawierająca nazwę pakietu dla podmodułów).

source: The ``platform`` option, if present, is a comma-separated list of the platforms on which the module is available (if it is available on all platforms, the option should be omitted). The keys are short identifiers; examples that are in use include "IRIX", "Mac", "Windows", and "Unix". It is important to use a key which has already been used when applicable.
pl: Opcja ``maszyna/środowisko`` - z ang. -``platform`` jeśli obecna, jest rozdzieloną przecinkami listą maszyn/środowisk na których moduł jest dostępny (jeśli jest dostępny na wszystkich platformach, opcja powinna zostać pominięta). Klucze są krótkimi identyfikatorami; przykłady które są w użyciu obejmują "IRIX", "Mac", "Windows", i "Unix". Istotne jest użycie klucza, który już był używany tam gdzie jest to stosowne.

source: The ``synopsis`` option should consist of one sentence describing the module's purpose -- it is currently only used in the Global Module Index.
pl: Opcja ``synopsis`` powinna składać się z jednego zdania opisującego cel modułu -- jest ona obecnie tylko używana w Globalnym Indeksie Modułów.

source: The ``deprecated`` option can be given (with no value) to mark a module as deprecated; it will be designated as such in various locations then.
pl: Opcja ``przedawniony`` - z ang. - ``deprecated`` może być podany (bez wartości) aby oznaczyć moduł jako przedawniony; będzie on określony jako taki w różnych miejscach wtedy.

source: The ``moduleauthor`` directive, which can appear multiple times, names the authors of the module code, just like ``sectionauthor`` names the author(s) of a piece of documentation. It too does not result in any output currently.
pl: Dyrektywa ``autormodułu`` - z ang. - ``moduleauthor``, która może pojawić się wielokrotnie, wymienia imię i nazwisko autorów kodu modułu, tak jak ``sectionauthor`` - z ang. - ``autorsekcji`` wymienia nazwisko i imię autora części dokumentacji. To także nie wpływa na żaden wynik obecnie.

source: It is important to make the section title of a module-describing file meaningful since that value will be inserted in the table-of-contents trees in overview files.
pl: To jest istotne aby uczynić nagłówek sekcji pliku opisującego moduł zrozumiałym gdyż ta wartość będzie włożona w drzewa spisu treści w plikach przeglądu.

source: There are a number of directives used to describe specific features provided by modules. Each directive requires one or more signatures to provide basic information about what is being described, and the content should be the description. The basic version makes entries in the general index; if no index entry is desired, you can give the directive option flag ``:noindex:``. The following example shows all of the features of this directive type::
pl: Istnieje pewna ilość dyrektyw używanych do opisania szczególnych właściwości dostarczanych przez moduły. Każda dyrektywa wymaga jednej lub więcej sygnatury aby zapewnić podstawowe informacje o tym co jest opisywane, i treść powinna być zgodna z tym opisem. Podstawowa wersja oznacza wpisy w głównym indeksie; jeśli żaden wpis w indeksie nie jest oczekiwany, można pozostawić flagę opcji dyrektywy ``:noindex:``. Następujący przykład pokazuje wszystkie właściwości tego rodzaju dyrektywy::

source: .. function:: spam(eggs) ham(eggs) :noindex: Spam or ham the foo.
pl: .. function:: spam(jajka) szynka(jajka) :noindex: Spam lub szynka foo.

source: The signatures of object methods or data attributes should always include the type name (``.. method:: FileInput.input(...)``), even if it is obvious from the context which type they belong to; this is to enable consistent cross-references. If you describe methods belonging to an abstract protocol, such as "context managers", include a (pseudo-)type name too to make the index entries more informative.
pl: Sygnatury sposobów postępowania przedmiotów lub właściwości danych powinny zawsze zawierać nazwę typu (``.. method:: FileInput.input(...)``), nawet jeśli wynika to w sposób oczywisty z kontekstu do jakiego typu należy; to służy umożliwieniu spójnego krzyżowego-odwoływania się. Jeśli opisujesz sposoby postępowania należące do protokołu abstrakcyjnego, takiego jak "zarządca kontekstu", włączaj nazwę (pseudo-)typu także aby uczynić wpisy indeksowe takimi aby niosły ze sobą bardziej znaczącą informację.

source: The directives are:
pl: Dyrektywami są:

source: Describes a C function. The signature should be given as in C, e.g.::
pl: Opisuje zadanie C. Sygnatura powinna być dana jak w C np.::

source: This is also used to describe function-like preprocessor macros. The names of the arguments should be given so they may be used in the description.
pl: To jest także używane aby opisywać podobne do zadań makra preprocesora. Nazwy parametrów powinny być dane tak aby mogły być używane w opisie.

source: Note that you don't have to backslash-escape asterisks in the signature, as it is not parsed by the reST inliner.
pl: Zauważ że nie musisz wstawiać znaku ukośnika ucieczkującego znak gwiazdki w sygnaturze, jako że nie jest ona wczytywana przez dyrektywę jedno-liniową reST.

source: Describes a C struct member. Example signature::
pl: Opisuje członka struktury C. Przykładowa sygnatura::

source: The text of the description should include the range of values allowed, how the value should be interpreted, and whether the value can be changed. References to structure members in text should use the ``member`` role.
pl: Tekst opisu powinien zawierać zakres wartości dozwolonych, jak wartość powinna być interpretowana, i czy wartość może być zmieniona. Odwołania do członków struktury powinny używać roli ``członka`` - z ang. - ``member``.

source: Describes a "simple" C macro. Simple macros are macros which are used for code expansion, but which do not take arguments so cannot be described as functions. This is not to be used for simple constant definitions. Examples of its use in the Python documentation include :cmacro:`PyObject_HEAD` and :cmacro:`Py_BEGIN_ALLOW_THREADS`.
pl: Opisuje "proste" makropolecenie C. Proste makropolecenia są makropoleceniami które są używane do rozwijania kodu, ale nie przyjmują parametrów więc nie mogą być opisywane jako zadania. To jest nie po to aby określać proste definicje. Przykładami użycia w dokumentacji języka pytonowskiego zawierają :cmacro:`PyObject_HEAD` i :cmacro:`PyBEGIN_ALLOW_THREADS`.

source: Describes a C type. The signature should just be the type name.
pl: Opisuje typ C. Sygnatura powinna być tylko nazwą typu.

source: Describes a global C variable. The signature should include the type, such as::
pl: Opisuje nadrzędnego poziomu zmienną C. Sygnatura powinna zawierać typ tak jak::

source: Describes global data in a module, including both variables and values used as "defined constants." Class and object attributes are not documented using this environment.
pl: Opisuje nadrzędne dane w module, zawierając zarówno zmienne jak i wartości używane jako "zdefiniowane stałe." Właściwości przedmiotu i uogólnienia nie są udokumentowane przy użyciu tego środowiska.

source: Describes an exception class. The signature can, but need not include parentheses with constructor arguments.
pl: Opisuje uogólnienie wyjątku. Sygnatura może, ale nie musi zawierać nawiasów z parametrami konstruktora.

source: Describes a module-level function. The signature should include the parameters, enclosing optional parameters in brackets. Default values can be given if it enhances clarity. For example::
pl: Opisuje zadanie na poziomie modułu. Sygnatura powinna zawierać parametry, zamykać ponad-obowiązkowe parametry w nawiasach. Domyślne wartości mogą być podane jeśli to pomaga w jasności. Na przykład::

source: Object methods are not documented using this directive. Bound object methods placed in the module namespace as part of the public interface of the module are documented using this, as they are equivalent to normal functions for most purposes.
pl: Sposoby postępowania przedmiotów nie są udokumentowane używając tej dyrektywy. Związane sposoby postępowania przedmiotów umieszczone w przestrzeni nazw modułu jako część sprzęgu publicznego modułu są dokumentowane używając tego, jako że są równoważne ze zwykłymi zadaniami dla większości celów.

source: The description should include information about the parameters required and how they are used (especially whether mutable objects passed as parameters are modified), side effects, and possible exceptions. A small example may be provided.
pl: Opis powinien zawierać informacje o parametrach wymaganych i jak powinny być używane (szczególnie czy zmienialne przedmioty przekazywane jako parametry są modyfikowane), efekty uboczne i możliwe wyjątki. Mały przykład może być dostarczony.

source: Describes a class. The signature can include parentheses with parameters which will be shown as the constructor arguments.
pl: Opisuje uogólnienie. Sygnatura powinna zawierać nawiasy z parametrami które będą pokazane jako parametry konstruktora.

source: Describes an object data attribute. The description should include information about the type of the data to be expected and whether it may be changed directly.
pl: Opisuje właściwość danych obiektu. Opis powinien zawierać informacje o rodzaju danych które są oczekiwane i czy mogą być zmieniane bezpośrednio.

source: Describes an object method. The parameters should not include the ``self`` parameter. The description should include similar information to that described for ``function``.
pl: Opisuje sposób postępowania obiektu. Parametry nie powinny zawierać parametru ``self`` - z ang. - ``sam``. Opis powinien zawierać podobne informacje do tych opisanych dla ``zadania`` - z ang. - ``function``.

source: Describes a Python :term:`bytecode` instruction.
pl: Opisuje instrukcje kodu kęsowego języka pytonowskiego - z ang. - :term:`bytecode`.

source: Describes a command line option or switch. Option argument names should be enclosed in angle brackets. Example::
pl: Opisuje opcję wiersza polecenia lub przełącznik. Nazwy parametrów opcji powinny być otoczone nawiasami klamrowymi. Przykład::

source: .. cmdoption:: -m <module> Run a module as a script.
pl: .. cmdoption:: -m <module> Uruchom moduł jako skrypt.

source: Describes an environment variable that Python uses or defines.
pl: Opisuje zmienną środowiskową którą język pytonowski używa lub definiuje.

source: There is also a generic version of these directives:
pl: Istnieje także generyczna wersja tych dyrektyw:

source: This directive produces the same formatting as the specific ones explained above but does not create index entries or cross-referencing targets. It is used, for example, to describe the directives in this document. Example::
pl: Ta dyrektywa produkuje to samo formatowanie jak te szczególne określone powyżej ale nie tworzy wpisów indeksu ani celów krzyżowych-odniesień. Jest używana, dla przykładu, aby opisać dyrektywy w tym dokumencie. Na przykład::

source: .. describe:: opcode Describes a Python bytecode instruction.
pl: .. describe:: opcode Opisuje instrukcję języka pytonowskiego kęso-kodową.

source: Showing code examples
pl: Pokazywanie przykładów kodu

source: Examples of Python source code or interactive sessions are represented using standard reST literal blocks. They are started by a ``::`` at the end of the preceding paragraph and delimited by indentation.
pl: Przykłady kodu źródłowego języka pytonowskiego lub sesji współpracy użytkownika w środowisku są reprezentowane używając bloków literalnych reST. Zaczynają się od ``::`` na końcu poprzedniego paragrafu i kończą się przez wcięcie.

source: Representing an interactive session requires including the prompts and output along with the Python code. No special markup is required for interactive sessions. After the last line of input or output presented, there should not be an "unused" primary prompt; this is an example of what *not* to do::
pl: Reprezentowanie sesji współpracy użytkownika z programem w środowisku wymaga zawarcia zapytań i wyników razem z kodem języka pytonowskiego. Żadne specjalne adnotacje nie są wymagane dla sesji użytkownika w środowisku interpretowanym. Po ostatniej linii wprowadzania lub wyjścia która jest obecna, nie powinno pozostać "nieużywane" podstawowe zapytanie; to jest przykład tego czego *nie* robić::

source: Syntax highlighting is handled in a smart way:
pl: Podświetlenie składni jest obsługiwane w sprytny sposób:

source: There is a "highlighting language" for each source file. Per default, this is ``'python'`` as the majority of files will have to highlight Python snippets.
pl: Istnieje "język podświetleń" dla każdego pliku źródłowego. Domyślnie jest to ``'python'`` jako że większość plików będzie musiało podświetlać urywki języka pytonowskiego.

source: Within Python highlighting mode, interactive sessions are recognized automatically and highlighted appropriately.
pl: Wewnątrz trybu podświetlania języka pytonowskiego, sesje współpracy użytkownika ze środowiskiem programu są rozpoznawane automatycznie i podświetlane odpowiednio.

source: The highlighting language can be changed using the ``highlightlang`` directive, used as follows::
pl: Język podświetleń może być zmieniany używając dyrektywy ``highlightlang``, używanej jak następuje::

source: This language is used until the next ``highlightlang`` directive is encountered.
pl: Ten język jest używany dopóki następna dyrektywa ``highlightlang`` nie zostanie napotkana.

source: The values normally used for the highlighting language are:
pl: Wartości zwykle używane dla języków podświetlania to:

source: ``python`` (the default)
pl: ``python`` (domyślnie)

source: ``none`` (no highlighting)
pl: ``none`` (bez podświetlania)

source: If highlighting with the current language fails, the block is not highlighted in any way.
pl: Jeśli podświetlanie w obecnym języku zawiedzie, blok nie będzie podświetlany w żaden sposób.

source: Longer displays of verbatim text may be included by storing the example text in an external file containing only plain text. The file may be included using the ``literalinclude`` directive. [1]_ For example, to include the Python source file :file:`example.py`, use::
pl: Dłuższe obecności tekstu słowo-w-słowo mogą być zawierane przez przechowanie przykładowego tekstu w pliku zewnętrznym zawierającym tylko czysty tekst. Plik może być zawarty używając dyrektywy ``literalinclude``. [1]_ Dla przykładu, aby zawrzeć plik źródłowy języka pytonowskiego :file:`example.py`, użyj::

source: The file name is relative to the current file's path. Documentation-specific include files should be placed in the ``Doc/includes`` subdirectory.
pl: Ta nazwa pliku jest względna do ścieżki dostępu do obecnego pliku. Pliki załączane szczególne dla dokumentacji powinny być umieszczane w podkatalogu ``Doc/includes``.

source: As said before, Sphinx uses interpreted text roles to insert semantic markup in documents.
pl: Jak powiedziano wcześniej, Sphinx używa interpretowanych ról tekstowych aby wstawić składniowe adnotacje do dokumentów.

source: Names of local variables, such as function/method arguments, are an exception, they should be marked simply with ``*var*``.
pl: Nazwy zmiennych lokalnych, takie jak parametry zadania/sposobu postępowania są wyjątkiem, powinny być oznaczone po prostu za pomocą ``*var*``.

source: For all other roles, you have to write ``:rolename:`content```.
pl: Dla wszystkich innych ról, trzeba pisać ``:nazwa_roli:`treść```.

source: There are some additional facilities that make cross-referencing roles more versatile:
pl: Istnieją pewne dodatkowe urządzenia które czynią krzyżowo-odnoszące się role bardziej wszechstronne:

source: You may supply an explicit title and reference target, like in reST direct hyperlinks: ``:role:`title <target>``` will refer to *target*, but the link text will be *title*.
pl: Możesz dostarczyć jawny nagłówek i cel odnośnika, jak w bezpośrednich łączach reST: ``:role:`tytuł <cel>``` będzie odnosiło się do do *celu*, ale tekstem linku będzie *tytuł*.

source: If you prefix the content with ``!``, no reference/hyperlink will be created.
pl: Jeśli poprzedzisz treść za pomocą ``!``, nie zostanie utworzony żadne odniesienie/hiperłącze.

source: For the Python object roles, if you prefix the content with ``~``, the link text will only be the last component of the target. For example, ``:meth:`~Queue.Queue.get``` will refer to ``Queue.Queue.get`` but only display ``get`` as the link text.
pl: Dla ról przedmiotów, jeśli poprzedzisz treść za pomocą ``~``, tekst łącza będzie tylko ostatnim komponentem celu. Dla przykładu, ``:meth:`~Queue.Queue.get``` będzie odnosić się do ``Queue.Queue.get`` ale będzie wyświetlać tylko ``get`` jako tekst łącza.

source: In HTML output, the link's ``title`` attribute (that is e.g. shown as a tool-tip on mouse-hover) will always be the full target name.
pl: W wyjściu HTML, atrybut ``title`` łącza (to jest np. pokazywane jako podpowiedź przy najechaniu kursorem myszy) będzie zawsze pełną nazwą celu.

source: The following roles refer to objects in modules and are possibly hyperlinked if a matching identifier is found:
pl: Następujące role odnoszą się do przedmiotów w modułach i są możliwie połączone hiperłączami jeśli pasujący identyfikator zostanie znaleziony:

source: The name of a module; a dotted name may be used. This should also be used for package names.
pl: Nazwa modułu; nazwa przedzielona kropkami może być użyta. To powinno także być użyte dla nazw pakietów.

source: The name of a Python function; dotted names may be used. The role text should not include trailing parentheses to enhance readability. The parentheses are stripped when searching for identifiers.
pl: Nazwa zadania pytonowskiego; nazwy przedzielone kropkami mogą być użyte. Tekst roli nie powinien zawierać kończących nawiasów aby wspomóc czytelność. Nawiasy są zdejmowane gdy poszukiwane są identyfikatory.

source: The name of a module-level variable or constant.
pl: Nazwa zmiennej lub stałej na poziomie modułu.

source: The name of a "defined" constant. This may be a C-language ``#define`` or a Python variable that is not intended to be changed.
pl: Nazwa "zdefiniowanej" stałej. Może być w języku C ``#define`` lub być zmienną języka pytonowskiego, która jest przeznaczona do pozostania bez zmian.

source: A class name; a dotted name may be used.
pl: Nazwa uogólnienia; nazwa rozdzielona kropkami może być użyta.

source: The name of a method of an object. The role text should include the type name and the method name. A dotted name may be used.
pl: Nazwa sposobu postępowania należącego do przedmiotu. Tekst roli powinien zawierać nazwę typu przedmiotu i nazwę sposobu postępowania. Nazwa przedzielona kropkami może zostać użyta.

source: The name of a data attribute of an object.
pl: Nazwa właściwości danych przedmiotu.

source: The name of an exception. A dotted name may be used.
pl: Nazwa wyjątku. Przedzielona kropkami nazwa może być użyta.

source: The name enclosed in this markup can include a module name and/or a class name. For example, ``:func:`filter``` could refer to a function named ``filter`` in the current module, or the built-in function of that name. In contrast, ``:func:`foo.filter``` clearly refers to the ``filter`` function in the ``foo`` module.
pl: Nazwa zawarta w tej adnotacji może zawierać nazwę modułu i/lub nazwę uogólnienia. Dla przykładu, ``:func:`filtr``` może odnosić się do zadania nazwanego ``filtr`` w obecnym module, lub wbudowanego zadania o tej samej nazwie. W przeciwieństwie, ``:func:`foo.filtr``` jasno odnosi się do zadania ``filtr`` modułu ``foo``.

source: Normally, names in these roles are searched first without any further qualification, then with the current module name prepended, then with the current module and class name (if any) prepended. If you prefix the name with a dot, this order is reversed. For example, in the documentation of the :mod:`codecs` module, ``:func:`open``` always refers to the built-in function, while ``:func:`.open``` refers to :func:`codecs.open`.
pl: Typowo, nazwy w tych rolach są przeszukiwane najpierw bez żadnej dalszej kwalifikacji, potem z przedrostkiem nazwy obecnego modułu dołożonym z przodu, potem z przedrostkiem nazwy modułu i uogólnienia (jeśli jakiegokolwiek) doklejonym z przodu. Jeśli dołożysz przedrostek w postaci kropki, ten porządek jest odwracany. Dla przykładu w dokumentacji modułu :mod:`codecs`, ``:func:`open``` zawsze odnosi się do wbudowanego zadania, podczas gdy ``:func:`.open``` odnosi się do :func:`codecs.open`.

source: A similar heuristic is used to determine whether the name is an attribute of the currently documented class.
pl: Podobne szacowanie jest używane aby określić czy nazwa jest atrybutem obecnie dokumentowanego uogólnienia.
